tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mike-engel/jwt-cli"
tap "planetscale/tap"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "bat"
brew "blueutil"
brew "bottom"
brew "coreutils"
brew "python@3.10"
brew "detect-secrets"
brew "exa"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gitleaks"
brew "glances"
brew "go"
brew "netpbm"
brew "graphviz"
brew "grep"
brew "node"
brew "gtop"
brew "helm"
brew "hub"
brew "jq"
brew "krb5"
brew "kubernetes-cli"
brew "kubectx"
brew "libfido2"
brew "mysql"
brew "nmap"
brew "openjdk@11"
brew "openssl@3"
brew "postgresql@14"
brew "pre-commit"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.9"
brew "ripgrep"
brew "shellcheck"
brew "sleepwatcher"
brew "stern"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vde"
brew "wakeonlan"
brew "watch"
brew "wget"
brew "wimlib"
brew "yarn"
brew "yq"
brew "mike-engel/jwt-cli/jwt-cli"
brew "planetscale/tap/pscale"
cask "1password"
cask "drawio"
cask "firefox"
cask "gimp"
cask "google-cloud-sdk"
cask "iterm2"
cask "linear-linear"
cask "notion"
cask "rectangle"
cask "slack"
cask "spotify"
cask "stats"
cask "visual-studio-code"
