tap "homebrew/bundle"
tap "homebrew/cask"
# tap "homebrew/core"
brew "bat"
brew "blueutil"
brew "coreutils"
brew "exa"
brew "fzf"
brew "git-delta"
brew "go@1.16"
brew "grep"
brew "node"
brew "gtop"
brew "hub"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "mysql"
brew "nmap"
brew "openjdk@11"
brew "postgresql@14"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.9"
brew "ripgrep"
brew "shellcheck"
brew "sleepwatcher"
brew "stern"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wakeonlan"
brew "watch"
brew "wget"
brew "wimlib"
brew "yarn"
brew "yq"
cask "1password"
cask "firefox"
cask "gimp"
cask "google-cloud-sdk"
cask "iterm2"
cask "linear-linear"
cask "notion"
cask "rectangle"
cask "slack"
cask "spotify"
cask "stats"
cask "visual-studio-code"
