tap "ai-cli/ai-pim-utils", "https://outlook-cli-80d21a.gitlab-master-pages.nvidia.com/homebrew-ai-pim-utils.git"

brew "atuin"
brew "direnv"
brew "git"
brew "git-delta"
brew "go-task"
brew "googleworkspace-cli"
brew "node"
brew "pipx"
brew "pre-commit"
brew "rust"
brew "starship"
brew "the_silver_searcher"

cask "ai-cli/ai-pim-utils/ai-pim-utils"
cask "codex"
cask "claude-code@latest"
